tutorials/multiRegion/CHT/vacuumFurnace/system/heater/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/fluid";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0.2 -0.3 0)
    (0.2 0 0.3)
    (0.2 0.3 0)
    (0.2 0 -0.3)
    (0.2 -0.32 0)
    (0.2 0 0.32)
    (0.2 0.32 0)
    (0.2 0 -0.32)
    (0.8 -0.3 0)
    (0.8 0 0.3)
    (0.8 0.3 0)
    (0.8 0 -0.3)
    (0.8 -0.32 0)
    (0.8 0 0.32)
    (0.8 0.32 0)
    (0.8 0 -0.32)
);


blocks
(
    hex (4 12 8 0 5 13 9 1) (24 3 10) simpleGrading (1 1 1)
    hex (5 13 9 1 6 14 10 2) (24 3 10) simpleGrading (1 1 1)
    hex (6 14 10 2 7 15 11 3) (24 3 10) simpleGrading (1 1 1)
    hex (7 15 11 3 4 12 8 0) (24 3 10) simpleGrading (1 1 1)
);

edges
(
    arc 1 0 90 (1 0 0)
    arc 2 1 90 (1 0 0)
    arc 3 2 90 (1 0 0)
    arc 0 3 90 (1 0 0)
    arc 5 4 90 (1 0 0)
    arc 6 5 90 (1 0 0)
    arc 7 6 90 (1 0 0)
    arc 4 7 90 (1 0 0)

    arc 9 8 90 (1 0 0)
    arc 10 9 90 (1 0 0)
    arc 11 10 90 (1 0 0)
    arc 8 11 90 (1 0 0)
    arc 13 12 90 (1 0 0)
    arc 14 13 90 (1 0 0)
    arc 15 14 90 (1 0 0)
    arc 12 15 90 (1 0 0)
);

defaultPatch
{
    name heater;
    type wall;
}

boundary
(
);

mergePatchPairs
(
);


// ************************************************************************* //
