tutorials/multiRegion/CHT/vacuumFurnace/constant/fluid/radiationProperties.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiationModel  fvDOM;

fvDOMCoeffs
{
    nPhi        3;
    nTheta      3;
    tolerance   1e-3;
    maxIter     10;
}

solverFreq 1;

absorptionEmissionModel constant;

constantCoeffs
{
    absorptivity    absorptivity    [0 -1 0 0 0 0 0] 0;
    emissivity      emissivity      [0 -1 0 0 0 0 0] 0;
    E               E               [1 -1 -3 0 0 0 0] 0;
}

scatterModel    none;

sootModel       none;

// ************************************************************************* //
